'use strict';
 export class Permissions { 
 static get globalPermissions () { 
 return {
  "ActuatorsСontrol": {
    "displayName": "Управление исполнительными механизмами",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "CallProgram": {
    "displayName": "Вызов программы",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "ChangeSetpoints": {
    "displayName": "Задание уставок",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "ChangeSettings": {
    "displayName": "Изменение настроек",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "Control": {
    "displayName": "Управление",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "DataTableEdit": {
    "displayName": "Редактирование ячеек таблицы",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "DataTableFilter": {
    "displayName": "Использование фильтров в таблице",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "DirectoryAdd": {
    "displayName": "Добавление записи справочника",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "DirectoryDelete": {
    "displayName": "Удаление записи справочника",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "DirectoryEdit": {
    "displayName": "Редактирование записи справочника",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "DirectoryFilter": {
    "displayName": "Использование фильтров в справочнике",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "IntervalsSettings": {
    "displayName": "Настройка интервалов",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "JournalAck": {
    "displayName": "Квитирование сообщения",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "JournalGroupAck": {
    "displayName": "Групповое квитирование сообщений",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "JournalPrint": {
    "displayName": "Печать сообщений",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "JournalSave": {
    "displayName": "Экспорт сообщений",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "JournalUseFilters": {
    "displayName": "Использование фильтров в журнале",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "Login": {
    "displayName": "Вход в систему",
    "requirePassword": false,
    "rights": {
      "_All": 9
    }
  },
  "OpenWindow": {
    "displayName": "Открытие окна",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "PenGroupsCreate": {
    "displayName": "Создание групп перьев",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "ReadUsers": {
    "displayName": "Чтение пользователей",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "ReadValue": {
    "displayName": "Чтение значения",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "StandardIntervalsSelect": {
    "displayName": "Выбор стандартных интервалов",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "TrendAddPens": {
    "displayName": "Изменение состава перьев",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "TrendChangePens": {
    "displayName": "Изменение настройки перьев",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "TrendPrint": {
    "displayName": "Печать графика",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "TrendSave": {
    "displayName": "Экспорт графика",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  },
  "WriteValue": {
    "displayName": "Запись значения",
    "requirePassword": false,
    "rights": {
      "_All": 1
    }
  }
} 
 }
 static get elementsPermissions () { 
 return {
  "1015329": {
    "1819379": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819547": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819715": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "101577": {
    "1818751": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818835": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818919": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1023847": {
    "1819499": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819667": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819835": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1032707": {
    "1819503": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819671": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819839": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1038245": {
    "1819443": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819611": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819779": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "110619": {
    "1818775": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818859": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818943": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "114155": {
    "1818779": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818863": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818947": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1193616": {
    "1819447": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819615": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819783": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1195006": {
    "1819451": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819619": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819787": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1196396": {
    "1819455": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819623": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819791": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1197786": {
    "1819459": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819627": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819795": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1199176": {
    "1819463": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819631": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819799": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1200566": {
    "1819467": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819635": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819803": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1201956": {
    "1819471": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819639": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819807": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1203346": {
    "1819475": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819643": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819811": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1204736": {
    "1819479": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819647": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819815": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1206126": {
    "1819483": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819651": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819819": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1501752": {
    "1818783": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818867": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818951": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1502352": {
    "1818787": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818871": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818955": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1503552": {
    "1818791": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818875": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818959": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1507150": {
    "1818795": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818879": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818963": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1507750": {
    "1818799": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818883": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818967": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1508350": {
    "1818803": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818887": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818971": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1508950": {
    "1818807": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818891": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818975": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1509550": {
    "1818811": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818895": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818979": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1510150": {
    "1818815": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818899": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818983": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1510750": {
    "1818819": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818903": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818987": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1511350": {
    "1818823": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818907": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818991": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1511950": {
    "1818827": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818911": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818995": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "1520630": {
    "1819487": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819655": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819823": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1521227": {
    "1819491": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819659": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819827": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "1522421": {
    "1819495": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819663": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819831": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "174797": {
    "1818771": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818855": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818939": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "442855": {
    "1819343": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819511": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819679": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "443147": {
    "1819347": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819515": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819683": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "443439": {
    "1819351": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819519": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819687": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "443731": {
    "1819355": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819523": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819691": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "444023": {
    "1819359": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819527": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819695": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "444315": {
    "1819363": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819531": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819699": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "444607": {
    "1819367": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819535": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819703": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "444899": {
    "1819371": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819539": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819707": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "445191": {
    "1819375": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819543": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819711": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "445483": {
    "1819383": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819551": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819719": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "445775": {
    "1819387": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819555": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819723": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "446067": {
    "1819391": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819559": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819727": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "446359": {
    "1819395": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819563": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819731": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "446651": {
    "1819399": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819567": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819735": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "446943": {
    "1819403": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819571": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819739": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "447235": {
    "1819407": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819575": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819743": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "447527": {
    "1819411": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819579": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819747": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "447819": {
    "1819415": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819583": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819751": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "448111": {
    "1819419": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819587": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819755": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "448403": {
    "1819423": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819591": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819759": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "448695": {
    "1819427": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819595": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819763": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "448987": {
    "1819431": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819599": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819767": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "449279": {
    "1819435": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819603": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819771": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "449571": {
    "1819439": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819607": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    },
    "1819775": {
      "Control": {
        "Администротор": 1,
        "_All": 0,
        "Оператор": 2
      }
    }
  },
  "64017": {
    "1818755": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818839": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818923": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "647877": {
    "1818759": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818843": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818927": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "65555": {
    "1818763": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818847": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818931": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  },
  "76417": {
    "1818767": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818851": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    },
    "1818935": {
      "Control": {
        "_All": 0,
        "Операторы": 2
      }
    }
  }
} 
 }
 static get objectsPermissions () { 
 return {
  "100931": {
    "parentId": 108705
  },
  "1014383": {
    "parentId": 114777
  },
  "1016356": {
    "parentId": 123320
  },
  "1018470": {
    "parentId": 247005
  },
  "1019498": {
    "parentId": 247591
  },
  "1019891": {
    "parentId": 123320
  },
  "1020221": {
    "parentId": 123320
  },
  "1020551": {
    "parentId": 123320
  },
  "1021374": {
    "parentId": 247591
  },
  "1021737": {
    "parentId": 123320
  },
  "1022067": {
    "parentId": 247591
  },
  "1022319": {
    "parentId": 247591
  },
  "1022571": {
    "parentId": 123320
  },
  "1022901": {
    "parentId": 114777
  },
  "1024307": {
    "parentId": 247004
  },
  "1024644": {
    "parentId": 247004
  },
  "1024896": {
    "parentId": 247004
  },
  "1025043": {
    "parentId": 1024896
  },
  "1025190": {
    "parentId": 247004
  },
  "1025652": {
    "parentId": 247591
  },
  "1025904": {
    "parentId": 247591
  },
  "1026475": {
    "parentId": 247591
  },
  "1026839": {
    "parentId": 247004
  },
  "1027091": {
    "parentId": 247004
  },
  "1027343": {
    "parentId": 247004
  },
  "1027595": {
    "parentId": 247004
  },
  "1031708": {
    "parentId": 114777
  },
  "1033687": {
    "parentId": 247005
  },
  "1034003": {
    "parentId": 123320
  },
  "1034228": {
    "parentId": 123320
  },
  "1034873": {
    "parentId": 247591
  },
  "1035125": {
    "parentId": 247591
  },
  "1035671": {
    "parentId": 247591
  },
  "1035818": {
    "parentId": 247591
  },
  "1036490": {
    "parentId": 247591
  },
  "1036637": {
    "parentId": 247591
  },
  "1036784": {
    "parentId": 247591
  },
  "1037246": {
    "parentId": 114777
  },
  "1038810": {
    "parentId": 247004
  },
  "1038957": {
    "parentId": 247004
  },
  "1039104": {
    "parentId": 247004
  },
  "106243": {
    "parentId": 111240
  },
  "107399": {
    "parentId": 123320
  },
  "107927": {
    "parentId": 114777
  },
  "109973": {
    "parentId": 108705
  },
  "112029": {
    "parentId": 111240
  },
  "112844": {
    "parentId": 112843
  },
  "113509": {
    "parentId": 108705
  },
  "114956": {
    "parentId": 114777
  },
  "116076": {
    "parentId": 114777
  },
  "116708": {
    "parentId": 114777
  },
  "118003": {
    "parentId": 114776
  },
  "118855": {
    "parentId": 114776
  },
  "1191481": {
    "parentId": 1549003
  },
  "1192617": {
    "parentId": 114777
  },
  "1194007": {
    "parentId": 114777
  },
  "1195397": {
    "parentId": 114777
  },
  "1196787": {
    "parentId": 114777
  },
  "119707": {
    "parentId": 114776
  },
  "1198177": {
    "parentId": 114777
  },
  "1199567": {
    "parentId": 114777
  },
  "1200957": {
    "parentId": 114777
  },
  "1202347": {
    "parentId": 114777
  },
  "1203737": {
    "parentId": 114777
  },
  "1205127": {
    "parentId": 114777
  },
  "120559": {
    "parentId": 114776
  },
  "1206517": {
    "parentId": 247601
  },
  "1207237": {
    "parentId": 247601
  },
  "1207957": {
    "parentId": 247601
  },
  "1208677": {
    "parentId": 247601
  },
  "1209397": {
    "parentId": 247601
  },
  "1210117": {
    "parentId": 247601
  },
  "1210837": {
    "parentId": 247601
  },
  "1211557": {
    "parentId": 247601
  },
  "1212277": {
    "parentId": 247601
  },
  "1213003": {
    "parentId": 247601
  },
  "1213723": {
    "parentId": 247601
  },
  "121411": {
    "parentId": 114776
  },
  "1214443": {
    "parentId": 247601
  },
  "1215163": {
    "parentId": 247601
  },
  "1215883": {
    "parentId": 247601
  },
  "1216603": {
    "parentId": 247601
  },
  "1217323": {
    "parentId": 247601
  },
  "1218043": {
    "parentId": 247601
  },
  "1218763": {
    "parentId": 247601
  },
  "1219483": {
    "parentId": 247601
  },
  "1220203": {
    "parentId": 247601
  },
  "1220923": {
    "parentId": 247601
  },
  "1221643": {
    "parentId": 247601
  },
  "1222363": {
    "parentId": 247601
  },
  "122263": {
    "parentId": 114776
  },
  "1223083": {
    "parentId": 247601
  },
  "1223803": {
    "parentId": 247601
  },
  "1290003": {
    "parentId": 123320
  },
  "1290228": {
    "parentId": 123320
  },
  "1290453": {
    "parentId": 123320
  },
  "1501351": {
    "parentId": 108705
  },
  "1501951": {
    "parentId": 108705
  },
  "1503151": {
    "parentId": 108705
  },
  "150575": {
    "parentId": 78
  },
  "1506749": {
    "parentId": 108705
  },
  "150734": {
    "parentId": 247598
  },
  "1507349": {
    "parentId": 108705
  },
  "1507949": {
    "parentId": 108705
  },
  "1508549": {
    "parentId": 108705
  },
  "1509149": {
    "parentId": 108705
  },
  "1509749": {
    "parentId": 108705
  },
  "1510349": {
    "parentId": 108705
  },
  "151063": {
    "parentId": 247597
  },
  "1510949": {
    "parentId": 108705
  },
  "1511549": {
    "parentId": 108705
  },
  "1512149": {
    "parentId": 114776
  },
  "151239": {
    "parentId": 247005
  },
  "1512550": {
    "parentId": 114776
  },
  "1512951": {
    "parentId": 114776
  },
  "1513352": {
    "parentId": 114776
  },
  "1513753": {
    "parentId": 114776
  },
  "151415": {
    "parentId": 247006
  },
  "1514154": {
    "parentId": 114776
  },
  "1514555": {
    "parentId": 114776
  },
  "1514956": {
    "parentId": 114776
  },
  "1515357": {
    "parentId": 114776
  },
  "1515758": {
    "parentId": 114776
  },
  "151591": {
    "parentId": 247007
  },
  "1516159": {
    "parentId": 114776
  },
  "1516560": {
    "parentId": 114776
  },
  "1516961": {
    "parentId": 114776
  },
  "1517362": {
    "parentId": 114776
  },
  "151767": {
    "parentId": 247599
  },
  "1517763": {
    "parentId": 114776
  },
  "1518164": {
    "parentId": 114776
  },
  "1518565": {
    "parentId": 114776
  },
  "1518966": {
    "parentId": 114776
  },
  "1519367": {
    "parentId": 114776
  },
  "151943": {
    "parentId": 247596
  },
  "1519768": {
    "parentId": 114776
  },
  "1520187": {
    "parentId": 114777
  },
  "1520784": {
    "parentId": 114777
  },
  "1521978": {
    "parentId": 114777
  },
  "1522877": {
    "parentId": 247601
  },
  "152295": {
    "parentId": 247598
  },
  "1523179": {
    "parentId": 247601
  },
  "1523481": {
    "parentId": 247601
  },
  "1523783": {
    "parentId": 247601
  },
  "1524085": {
    "parentId": 247601
  },
  "1524387": {
    "parentId": 247601
  },
  "1524689": {
    "parentId": 247601
  },
  "152471": {
    "parentId": 247597
  },
  "1524991": {
    "parentId": 247601
  },
  "1525293": {
    "parentId": 247601
  },
  "1525595": {
    "parentId": 247601
  },
  "1525897": {
    "parentId": 247601
  },
  "1526199": {
    "parentId": 247601
  },
  "152647": {
    "parentId": 247006
  },
  "1526501": {
    "parentId": 247601
  },
  "1526803": {
    "parentId": 247601
  },
  "1527105": {
    "parentId": 247601
  },
  "1527407": {
    "parentId": 247601
  },
  "1527709": {
    "parentId": 247601
  },
  "1528011": {
    "parentId": 247601
  },
  "152823": {
    "parentId": 247007
  },
  "1528313": {
    "parentId": 247601
  },
  "1528615": {
    "parentId": 247601
  },
  "1528917": {
    "parentId": 247601
  },
  "1529219": {
    "parentId": 639163
  },
  "1529453": {
    "parentId": 639163
  },
  "1529687": {
    "parentId": 639163
  },
  "1529921": {
    "parentId": 639163
  },
  "153003": {
    "parentId": 247599
  },
  "1530155": {
    "parentId": 639163
  },
  "1530389": {
    "parentId": 639163
  },
  "153179": {
    "parentId": 247595
  },
  "1531924": {
    "parentId": 1531057
  },
  "1532357": {
    "parentId": 1531057
  },
  "1533224": {
    "parentId": 1533223
  },
  "1533749": {
    "parentId": 1533223
  },
  "1534274": {
    "parentId": 1533223
  },
  "153531": {
    "parentId": 247598
  },
  "153707": {
    "parentId": 247597
  },
  "153883": {
    "parentId": 247006
  },
  "154059": {
    "parentId": 247007
  },
  "154235": {
    "parentId": 247008
  },
  "154411": {
    "parentId": 247592
  },
  "174151": {
    "parentId": 108705
  },
  "176254": {
    "parentId": 111240
  },
  "177565": {
    "parentId": 111240
  },
  "178467": {
    "parentId": 247596
  },
  "179049": {
    "parentId": 247008
  },
  "181592": {
    "parentId": 123320
  },
  "182414": {
    "parentId": 123320
  },
  "189830": {
    "parentId": 123320
  },
  "190172": {
    "parentId": 123320
  },
  "191676": {
    "parentId": 114777
  },
  "192308": {
    "parentId": 114777
  },
  "193073": {
    "parentId": 114777
  },
  "193852": {
    "parentId": 114777
  },
  "194484": {
    "parentId": 114777
  },
  "195473": {
    "parentId": 114776
  },
  "196307": {
    "parentId": 114776
  },
  "197371": {
    "parentId": 114777
  },
  "198003": {
    "parentId": 114777
  },
  "198873": {
    "parentId": 114777
  },
  "200115": {
    "parentId": 123320
  },
  "200453": {
    "parentId": 123320
  },
  "200960": {
    "parentId": 114777
  },
  "202197": {
    "parentId": 114777
  },
  "203580": {
    "parentId": 114777
  },
  "204317": {
    "parentId": 114776
  },
  "205151": {
    "parentId": 114776
  },
  "205985": {
    "parentId": 114776
  },
  "207593": {
    "parentId": 123320
  },
  "208103": {
    "parentId": 114776
  },
  "208937": {
    "parentId": 114776
  },
  "209771": {
    "parentId": 114777
  },
  "210789": {
    "parentId": 247005
  },
  "212143": {
    "parentId": 247005
  },
  "212319": {
    "parentId": 247005
  },
  "212495": {
    "parentId": 247005
  },
  "212671": {
    "parentId": 247006
  },
  "213826": {
    "parentId": 247007
  },
  "214122": {
    "parentId": 247003
  },
  "214369": {
    "parentId": 247005
  },
  "214650": {
    "parentId": 247005
  },
  "215258": {
    "parentId": 247591
  },
  "215539": {
    "parentId": 247004
  },
  "215820": {
    "parentId": 247004
  },
  "216213": {
    "parentId": 247005
  },
  "216494": {
    "parentId": 247005
  },
  "217226": {
    "parentId": 247006
  },
  "217705": {
    "parentId": 247007
  },
  "218176": {
    "parentId": 247003
  },
  "221797": {
    "parentId": 247006
  },
  "222219": {
    "parentId": 247007
  },
  "222514": {
    "parentId": 247003
  },
  "223133": {
    "parentId": 247010
  },
  "226003": {
    "parentId": 114777
  },
  "226754": {
    "parentId": 247005
  },
  "227035": {
    "parentId": 114776
  },
  "227869": {
    "parentId": 114776
  },
  "228703": {
    "parentId": 114776
  },
  "230089": {
    "parentId": 247006
  },
  "230568": {
    "parentId": 247003
  },
  "230787": {
    "parentId": 247007
  },
  "231377": {
    "parentId": 114777
  },
  "232865": {
    "parentId": 247005
  },
  "233174": {
    "parentId": 114777
  },
  "234238": {
    "parentId": 247591
  },
  "234559": {
    "parentId": 123320
  },
  "235109": {
    "parentId": 247004
  },
  "235410": {
    "parentId": 247007
  },
  "236304": {
    "parentId": 247004
  },
  "236585": {
    "parentId": 114777
  },
  "237336": {
    "parentId": 247005
  },
  "237701": {
    "parentId": 247005
  },
  "238567": {
    "parentId": 123320
  },
  "238842": {
    "parentId": 247004
  },
  "239873": {
    "parentId": 247010
  },
  "240532": {
    "parentId": 114776
  },
  "241366": {
    "parentId": 114776
  },
  "242430": {
    "parentId": 247594
  },
  "243192": {
    "parentId": 247592
  },
  "243487": {
    "parentId": 114777
  },
  "244224": {
    "parentId": 123320
  },
  "244499": {
    "parentId": 247591
  },
  "245019": {
    "parentId": 247004
  },
  "247011": {
    "parentId": 247592
  },
  "247602": {
    "parentId": 247601
  },
  "248329": {
    "parentId": 247601
  },
  "249056": {
    "parentId": 247601
  },
  "249783": {
    "parentId": 247601
  },
  "250510": {
    "parentId": 247601
  },
  "252601": {
    "parentId": 247601
  },
  "253292": {
    "parentId": 247601
  },
  "253983": {
    "parentId": 247601
  },
  "254674": {
    "parentId": 247601
  },
  "2805384": {
    "parentId": 78
  },
  "2848038": {
    "parentId": 78
  },
  "390003": {
    "parentId": 247601
  },
  "390682": {
    "parentId": 247601
  },
  "391361": {
    "parentId": 247601
  },
  "392040": {
    "parentId": 247601
  },
  "392719": {
    "parentId": 247601
  },
  "393398": {
    "parentId": 247601
  },
  "394077": {
    "parentId": 247601
  },
  "394756": {
    "parentId": 247601
  },
  "395435": {
    "parentId": 247601
  },
  "396114": {
    "parentId": 247601
  },
  "396793": {
    "parentId": 247601
  },
  "397472": {
    "parentId": 247601
  },
  "398151": {
    "parentId": 247601
  },
  "398830": {
    "parentId": 247601
  },
  "399509": {
    "parentId": 247601
  },
  "400188": {
    "parentId": 247601
  },
  "400867": {
    "parentId": 247601
  },
  "401546": {
    "parentId": 247601
  },
  "402225": {
    "parentId": 247601
  },
  "439044": {
    "parentId": 58250
  },
  "439215": {
    "parentId": 58250
  },
  "439274": {
    "parentId": 58250
  },
  "439333": {
    "parentId": 58250
  },
  "439392": {
    "parentId": 58250
  },
  "439451": {
    "parentId": 58250
  },
  "439510": {
    "parentId": 58250
  },
  "485138": {
    "parentId": 58250
  },
  "492233": {
    "parentId": 58250
  },
  "563003": {
    "parentId": 58250
  },
  "58250": {
    "parentId": 78
  },
  "63419": {
    "parentId": 108705
  },
  "637003": {
    "parentId": 247601
  },
  "637723": {
    "parentId": 247601
  },
  "638443": {
    "parentId": 247601
  },
  "639164": {
    "parentId": 639163
  },
  "639857": {
    "parentId": 639163
  },
  "640550": {
    "parentId": 639163
  },
  "641243": {
    "parentId": 639163
  },
  "641936": {
    "parentId": 639163
  },
  "642629": {
    "parentId": 639163
  },
  "643322": {
    "parentId": 639163
  },
  "644015": {
    "parentId": 639163
  },
  "644708": {
    "parentId": 639163
  },
  "646003": {
    "parentId": 247007
  },
  "647003": {
    "parentId": 108705
  },
  "648647": {
    "parentId": 247007
  },
  "648915": {
    "parentId": 247007
  },
  "649186": {
    "parentId": 247007
  },
  "64931": {
    "parentId": 108705
  },
  "650092": {
    "parentId": 247007
  },
  "655152": {
    "parentId": 247007
  },
  "662080": {
    "parentId": 206819
  },
  "662580": {
    "parentId": 206819
  },
  "662863": {
    "parentId": 206819
  },
  "663146": {
    "parentId": 206819
  },
  "663429": {
    "parentId": 206819
  },
  "663607": {
    "parentId": 206819
  },
  "664003": {
    "parentId": 206819
  },
  "664286": {
    "parentId": 206819
  },
  "664569": {
    "parentId": 206819
  },
  "668003": {
    "parentId": 664852
  },
  "668343": {
    "parentId": 664852
  },
  "668641": {
    "parentId": 664852
  },
  "671003": {
    "parentId": 247592
  },
  "675108": {
    "parentId": 247592
  },
  "675643": {
    "parentId": 247592
  },
  "675896": {
    "parentId": 247592
  },
  "677003": {
    "parentId": 247595
  },
  "678242": {
    "parentId": 247592
  },
  "678495": {
    "parentId": 247592
  },
  "681819": {
    "parentId": 111240
  },
  "68257": {
    "parentId": 114776
  },
  "683464": {
    "parentId": 247592
  },
  "683738": {
    "parentId": 114776
  },
  "684639": {
    "parentId": 114776
  },
  "685770": {
    "parentId": 247595
  },
  "686246": {
    "parentId": 247596
  },
  "686513": {
    "parentId": 247592
  },
  "687345": {
    "parentId": 247592
  },
  "687598": {
    "parentId": 247592
  },
  "689003": {
    "parentId": 247592
  },
  "689361": {
    "parentId": 247592
  },
  "689614": {
    "parentId": 247592
  },
  "689867": {
    "parentId": 247592
  },
  "690120": {
    "parentId": 247592
  },
  "691182": {
    "parentId": 247009
  },
  "691466": {
    "parentId": 247009
  },
  "691719": {
    "parentId": 247009
  },
  "691972": {
    "parentId": 247009
  },
  "692225": {
    "parentId": 247009
  },
  "692373": {
    "parentId": 206819
  },
  "692551": {
    "parentId": 206819
  },
  "692729": {
    "parentId": 206819
  },
  "692907": {
    "parentId": 206819
  },
  "693653": {
    "parentId": 247009
  },
  "693906": {
    "parentId": 247009
  },
  "694159": {
    "parentId": 247009
  },
  "695003": {
    "parentId": 114776
  },
  "695904": {
    "parentId": 114776
  },
  "696805": {
    "parentId": 114776
  },
  "697706": {
    "parentId": 114776
  },
  "698607": {
    "parentId": 114776
  },
  "699508": {
    "parentId": 114776
  },
  "70029": {
    "parentId": 114776
  },
  "701099": {
    "parentId": 206819
  },
  "701277": {
    "parentId": 206819
  },
  "701455": {
    "parentId": 206819
  },
  "702158": {
    "parentId": 206819
  },
  "702336": {
    "parentId": 206819
  },
  "703072": {
    "parentId": 247007
  },
  "703325": {
    "parentId": 247007
  },
  "703563": {
    "parentId": 247007
  },
  "703876": {
    "parentId": 247007
  },
  "705003": {
    "parentId": 247007
  },
  "705346": {
    "parentId": 247007
  },
  "705599": {
    "parentId": 247007
  },
  "705852": {
    "parentId": 247007
  },
  "706528": {
    "parentId": 247594
  },
  "706922": {
    "parentId": 247594
  },
  "707316": {
    "parentId": 247594
  },
  "707710": {
    "parentId": 247009
  },
  "70881": {
    "parentId": 114776
  },
  "709003": {
    "parentId": 247599
  },
  "710165": {
    "parentId": 247592
  },
  "710418": {
    "parentId": 247592
  },
  "711003": {
    "parentId": 247009
  },
  "711256": {
    "parentId": 247009
  },
  "711762": {
    "parentId": 247009
  },
  "712015": {
    "parentId": 247009
  },
  "712268": {
    "parentId": 247009
  },
  "712521": {
    "parentId": 247009
  },
  "712774": {
    "parentId": 247009
  },
  "713027": {
    "parentId": 247009
  },
  "713280": {
    "parentId": 247009
  },
  "713533": {
    "parentId": 247009
  },
  "713786": {
    "parentId": 247009
  },
  "714039": {
    "parentId": 247009
  },
  "714292": {
    "parentId": 247009
  },
  "714545": {
    "parentId": 247009
  },
  "714798": {
    "parentId": 247009
  },
  "715051": {
    "parentId": 247009
  },
  "71733": {
    "parentId": 114776
  },
  "72585": {
    "parentId": 114776
  },
  "73437": {
    "parentId": 114776
  },
  "74289": {
    "parentId": 114776
  },
  "75771": {
    "parentId": 108705
  },
  "77248": {
    "parentId": 114777
  },
  "77940": {
    "parentId": 114777
  },
  "82806": {
    "parentId": 112843
  },
  "95149": {
    "parentId": 123320
  },
  "95295": {
    "parentId": 78
  },
  "95435": {
    "parentId": 112843
  },
  "96783": {
    "parentId": 114777
  },
  "97850": {
    "parentId": 114776
  },
  "98702": {
    "parentId": 114776
  },
  "99554": {
    "parentId": 114776
  }
} 
 }
 static get operatorsRoles () { 
 return {
  "Admin": [
    "Администроторы"
  ],
  "User1": [
    "Операторы"
  ],
  "User2": [
    "Операторы"
  ]
} 
 }
 static get logActionTry () { 
 return {
  "_All": false,
  "Администроторы": false,
  "Операторы": false
} 
 }
}